Documents/бит_ВводСуммПоРаспределениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводСуммПоРаспределениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_Распределения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПоРаспределениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распределение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_РаспределенияНаУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_РаспределенияНаУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_ВводСуммПоРаспределениям/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
																,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.Улица = ПолучитьПустуюУлицу() Тогда
		
		Элементы.ПоказанияПоРаспределениямУлица.Видимость = Истина;
		
	ИначеЕсли НЕ Объект.Дом = ПолучитьПустойСписокЗданий() Тогда
		
		Элементы.ПоказанияПоРаспределениямДом.Видимость = Ложь;
		Элементы.ПоказанияПоРаспределениямУлица.Видимость = Ложь;
		
	Иначе
		
		Элементы.ПоказанияПоРаспределениямДом.Видимость = Истина;
		Элементы.ПоказанияПоРаспределениямУлица.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));

	// вызов механизма разделения прав доступа
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,ДокументОбъект,ЭтаФорма);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
		
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
    УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм
 
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьТаблицуПоказанийНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.ПоказанияПоРаспределениям.Очистить();
	Дом = ПолучитьПустойСписокЗданий();
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	Объект.ПоказанияПоРаспределениям.Очистить();
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры
 
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Объект.ПоказанияПоРаспределениям.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоРаспределениямСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПоказанияПоРаспределениям.ТекущиеДанные;
	
	Структура = ПоказанияПоРаспределениямСуммаПриИзмененииНаСервере(ТекСтрока.Дом);
	
	ТаблицаРпКоличество = Структура.ТаблицаРпКоличество;
	
	Если ТаблицаРпКоличество > 0 Тогда
		
		Элементы.НадписьСтавка.Заголовок = "Ставка = " + Строка(Структура.Ставка);
		Элементы.НадписьСумма.Заголовок  = "Итоговая сумма = " + Строка(ТекСтрока.Сумма *Структура.Ставка);
		
	Иначе
		
		Элементы.НадписьСтавка.Заголовок = "Ставка не установлена" ;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере 
 Функция СписокЛСнаРаспределении(Здание)
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
		|ИЗ
		|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Момент, Объект = &Дом) КАК бит_РаспределенияНаУслугахСрезПоследних";

	Запрос.УстановитьПараметр("Дом", Здание);
	Запрос.УстановитьПараметр("Момент", ТекущаяДата());

	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		
		ЛицевойСчет = Результат[0].ЛицевойСчет;
		
	Иначе
		
		ЛицевойСчет = Неопределено
		
	КонецЕсли; 
	
	Возврат ЛицевойСчет;
	
КонецФункции

&НаСервере
Функция ПоказанияПоРаспределениямСуммаПриИзмененииНаСервере(Дом)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"          , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта" , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"     , Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ТекущаяДата(), Объект.Организация, ПараметрыЖКХ);
	
	РасчетСУчетомДолейВладения           = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	УменьшениеНормыЛьготыВПределахФакта  = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	НачислениеСУчетомДнейПроживания      = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	
	СписокЛС = Новый Массив;
	
	ЛицевойСчет = СписокЛСнаРаспределении(Дом);
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СписокЛС.Добавить(ЛицевойСчет);
		
		СписокЗданий = Новый Массив;
		СписокЗданий.Добавить(Дом);       
		
		ТаблицаНач = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
		ТаблицаРп  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
		
		бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ТекущаяДата(), Объект.Организация,СписокЛС,СписокЗданий, , , ТаблицаНач, ,ТаблицаРп , ,,,РасчетСУчетомДолейВладения, УменьшениеНормыЛьготыВПределахФакта,НачислениеСУчетомДнейПроживания,);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "На здании нет лицевых счетов, подключенных к выбранному распределению";
		Сообщение.Сообщить();
		
		ТаблицаРп = Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Ставка = ТаблицаРп[0].Ставка;
	
	Структура = Новый Структура;
	Структура.Вставить("Ставка",Ставка);
	Структура.Вставить("ТаблицаРпКоличество",ТаблицаРп.Количество());
	
	Возврат Структура;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПоказанийНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ЗаполнитьТаблицуПоказаний();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьПустойСписокЗданий()
	
	Возврат Справочники.бит_СписокЗданий.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьПустуюУлицу()
	
	Возврат Справочники.бит_СписокУлиц.ПустаяСсылка();
	
КонецФункции
 
// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
		
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры

#КонецОбласти
